public class Case4 {

    /**
     * Я не нашел способа сделать это задание
     * Потому что для хорошего решения нужно создавать отдельную таблицу со всеми возможными int значениями
     * В выбранной мной СУБД Sqlite нет возможности добавления процедуры для заполнения этой таблицы
     * А значит это решение будет СУБД зависимым - это не хорошо.
     * Можно выбрать другую субд, но на это у меня не хватило времени.
     * @param args
     */
    public static void main(String[] args) {
    }

}
